require_relative '../rbase'
include Rbase

# テスト用データベース構築
init = proc do
	`zenra init`
end

# 定数定義

# テスト実行
describe 'ユーザページ機能' do
	before(&init)
	it '最近のカラオケが正常に表示されるか' do
		# 対象テーブルがN行存在することを検証する
		# 1つ以上の行をサンプリングして、内容を検証する
	end
	it '最近歌った曲が正常に表示されるか' do
		# 対象テーブルがN行存在することを検証する
		# 1つ以上の行をサンプリングして、内容を検証する
	end
	it '各種集計が正常に表示されるか' do
		# 一番歌ってる曲が正常に表示される
		# 一番歌っている歌手が正常に表示される
		# 最高得点が正常に表示される
	end
	it 'リンクが正常に登録されているか' do
		# 最近のカラオケにリンクが登録されていることを検証する
		# 最近歌った曲の曲名にリンクが登録されていることを検証する
		# 最近歌った曲の歌手名にリンクが登録されていること検証する
		# 一番歌っている曲の曲名にリンクが登録されていることを検証する
		# 一番歌っている曲の歌手名にリンクが登録されていることを検証する
		# 一番歌っている歌手の歌手名にリンクが登録されていることを検証する
		# 最高得点の曲名にリンクが登録されていることを検証する
		# 最高得点の歌手名にリンクが登録されていることを検証する
	end
end
